#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.lambda_function.data.external.archive_prepare[0]: Reading...
data.archive_file.lambda: Reading...
data.archive_file.lambda: Read complete after 0s [id=4d8dcb5bc76b080df01faa7097fdf922f4ef8272]
module.lambda_function.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=44bff5cf9d3bbdc1b23492ed2a878d920b789d7c]
module.lambda_function.null_resource.archive[0]: Refreshing state... [id=1916717533642383676]
module.s3_bucket.data.aws_caller_identity.current: Reading...
module.s3_bucket.data.aws_canonical_user_id.this[0]: Reading...
module.lambda_function.data.aws_partition.current: Reading...
module.lambda_function.data.aws_region.current: Reading...
module.s3_bucket.data.aws_partition.current: Reading...
module.lambda_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_bucket.data.aws_region.current: Reading...
aws_apigatewayv2_api.api: Refreshing state... [id=ibnh5cj45g]
module.lambda_function.data.aws_caller_identity.current: Reading...
module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/imageGenerator-lambda]
module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=image-generate]
module.s3_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.s3_bucket.data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_dynamodb_table.profile: Refreshing state... [id=profile]
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.s3_bucket.data.aws_caller_identity.current: Read complete after 0s [id=730335392708]
module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=imageGenerator-lambda]
module.lambda_function.data.aws_caller_identity.current: Read complete after 0s [id=730335392708]
module.s3_bucket.data.aws_canonical_user_id.this[0]: Read complete after 0s [id=7797a1854717fed9d22a1133797392ed0b42e6ceee5ae1b18e9fea2879fdd5ae]
module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::730335392708:policy/imageGenerator-lambda-logs]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/imageGenerator-API2]
aws_apigatewayv2_stage.apigateway: Refreshing state... [id=$default]
module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=imageGenerator-lambda-20240404152400024800000001]
module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=imageGenerator-lambda]
module.s3_bucket.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=image-generate]
module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=image-generate]
module.s3_bucket.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=image-generate]
module.s3_bucket.aws_s3_bucket_acl.this[0]: Refreshing state... [id=image-generate,private]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_apigatewayv2_integration.lambda["index"] will be created
  + resource "aws_apigatewayv2_integration" "lambda" {
      + api_id                                    = "ibnh5cj45g"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_integration.lambda["profile-get"] will be created
  + resource "aws_apigatewayv2_integration" "lambda" {
      + api_id                                    = "ibnh5cj45g"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_integration.lambda["profile-post"] will be created
  + resource "aws_apigatewayv2_integration" "lambda" {
      + api_id                                    = "ibnh5cj45g"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.default_route will be created
  + resource "aws_apigatewayv2_route" "default_route" {
      + api_id             = "ibnh5cj45g"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$default"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.lambda["index"] will be created
  + resource "aws_apigatewayv2_route" "lambda" {
      + api_id             = "ibnh5cj45g"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.lambda["profile-get"] will be created
  + resource "aws_apigatewayv2_route" "lambda" {
      + api_id             = "ibnh5cj45g"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /profile"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.lambda["profile-post"] will be created
  + resource "aws_apigatewayv2_route" "lambda" {
      + api_id             = "ibnh5cj45g"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /profile"
      + target             = (known after apply)
    }

  # module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.lambda_function.aws_cloudwatch_log_group.lambda[0] must be replaced
-/+ resource "aws_cloudwatch_log_group" "lambda" {
      ~ arn               = "arn:aws:logs:us-east-1:730335392708:log-group:/aws/lambda/imageGenerator-lambda" -> (known after apply)
      ~ id                = "/aws/lambda/imageGenerator-lambda" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/imageGenerator-lambda" -> "/aws/lambda/imageGenerator-lambda2" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "Name" = "terraform-imageGenerator-lambda"
        }
        # (3 unchanged attributes hidden)
    }

  # module.lambda_function.aws_iam_policy.logs[0] must be replaced
-/+ resource "aws_iam_policy" "logs" {
      ~ arn         = "arn:aws:iam::730335392708:policy/imageGenerator-lambda-logs" -> (known after apply)
      ~ id          = "arn:aws:iam::730335392708:policy/imageGenerator-lambda-logs" -> (known after apply)
      ~ name        = "imageGenerator-lambda-logs" -> "imageGenerator-lambda2-logs" # forces replacement
      + name_prefix = (known after apply)
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-1:730335392708:log-group:/aws/lambda/imageGenerator-lambda:*:*",
                          - "arn:aws:logs:us-east-1:730335392708:log-group:/aws/lambda/imageGenerator-lambda:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id   = "ANPA2UC3BWPCII2TLW7H6" -> (known after apply)
        tags        = {
            "Name" = "terraform-imageGenerator-lambda"
        }
        # (2 unchanged attributes hidden)
    }

  # module.lambda_function.aws_iam_role.lambda[0] must be replaced
-/+ resource "aws_iam_role" "lambda" {
      ~ arn                   = "arn:aws:iam::730335392708:role/imageGenerator-lambda" -> (known after apply)
      ~ create_date           = "2024-04-04T15:23:59Z" -> (known after apply)
      ~ id                    = "imageGenerator-lambda" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::730335392708:policy/imageGenerator-lambda-logs",
          - "arn:aws:iam::aws:policy/AWSLambdaInvocation-DynamoDB",
          - "arn:aws:iam::aws:policy/AWSLambda_FullAccess",
          - "arn:aws:iam::aws:policy/AmazonAPIGatewayAdministrator",
          - "arn:aws:iam::aws:policy/AmazonAPIGatewayInvokeFullAccess",
          - "arn:aws:iam::aws:policy/AmazonDynamoDBFullAccess",
          - "arn:aws:iam::aws:policy/AmazonS3FullAccess",
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaDynamoDBExecutionRole",
        ] -> (known after apply)
      ~ name                  = "imageGenerator-lambda" -> "imageGenerator-lambda2" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "Name" = "terraform-imageGenerator-lambda"
        }
      ~ unique_id             = "AROA2UC3BWPCB3C6JF26R" -> (known after apply)
        # (5 unchanged attributes hidden)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.lambda_function.aws_iam_role_policy_attachment.logs[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "logs" {
      ~ id         = "imageGenerator-lambda-20240404152400024800000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::730335392708:policy/imageGenerator-lambda-logs" -> (known after apply) # forces replacement
      ~ role       = "imageGenerator-lambda" -> "imageGenerator-lambda2" # forces replacement
    }

  # module.lambda_function.aws_lambda_function.this[0] must be replaced
-/+ resource "aws_lambda_function" "this" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:730335392708:function:imageGenerator-lambda" -> (known after apply)
      ~ function_name                  = "imageGenerator-lambda" -> "imageGenerator-lambda2" # forces replacement
      ~ id                             = "imageGenerator-lambda" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:730335392708:function:imageGenerator-lambda/invocations" -> (known after apply)
      ~ last_modified                  = "2024-04-04T17:55:01.884+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:730335392708:function:imageGenerator-lambda:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:730335392708:function:imageGenerator-lambda:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::730335392708:role/imageGenerator-lambda" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "oCn2Xs4p//fORRiml5cDiyxk5w42Rdo7Y/fVVFxq5kE=" -> (known after apply)
      ~ source_code_size               = 3724 -> (known after apply)
        tags                           = {
            "Name" = "terraform-imageGenerator-lambda"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (12 unchanged attributes hidden)

      ~ logging_config {
          ~ log_group  = "/aws/lambda/imageGenerator-lambda" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ tracing_config {
          ~ mode = "PassThrough" -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1916717533642383676" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1712255877317933000" -> "1712258495511885000"
            # (1 unchanged element hidden)
        }
    }

Plan: 13 to add, 0 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rauljrtafur, Action: `pull_request`*